regtests/0333_soap_optional_item/test.out

@ echoString
Echo String
This is the real value for the string!

@ echoStruct
Echo Struct
          6
 6.60
666

@ echoStruct
<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<ns2:echoStruct xmlns:ns2="http://nsoptional.org/"
 xmlns:ns1="http://nsoptional.org/xsd">
<ns1:inputStruct xsi:type="ns1:SOAPStruct">
   <varInt xsi:type="xsd:int">7</varInt>
   <varFloat xsi:type="xsd:float">7.00000E+00</varFloat>
   <varString xsi:type="xsd:string" xsi:nil="true"/>
</ns1:inputStruct>
</ns2:echoStruct>
</soapenv:Body>
</soapenv:Envelope>

<?xml version='1.0' encoding='UTF-8'?>
<soapenv:Envelope soapenv:encodingStyle="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap-enc="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
<soapenv:Body>
<ns2:echoStructResponse xmlns:ns2="http://nsoptional.org/"
 xmlns:ns1="http://nsoptional.org/xsd">
<ns1:outputStruct xsi:type="ns1:SOAPStruct">
   <varInt xsi:type="xsd:int">7</varInt>
   <varFloat xsi:type="xsd:float">7.00000E+00</varFloat>
   <varString xsi:type="xsd:string"></varString>
</ns1:outputStruct>
</ns2:echoStructResponse>
</soapenv:Body>
</soapenv:Envelope>
